; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	image2 - mode
	infrared1 - mode
	infrared0 - mode
	image3 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star1 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 148)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 189)
	(supports instrument3 infrared1)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 157)
	(supports instrument5 image3)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 174)
	(= (data Phenomenon4 image2) 16)
	(= (data Phenomenon5 image2) 107)
	(= (data Phenomenon6 image2) 18)
	(= (data Planet7 image2) 100)
	(= (data Star8 image2) 142)
	(= (data Planet9 image2) 192)
	(= (data Phenomenon4 infrared1) 252)
	(= (data Phenomenon5 infrared1) 8)
	(= (data Phenomenon6 infrared1) 125)
	(= (data Planet7 infrared1) 214)
	(= (data Star8 infrared1) 220)
	(= (data Planet9 infrared1) 65)
	(= (data Phenomenon4 infrared0) 177)
	(= (data Phenomenon5 infrared0) 106)
	(= (data Phenomenon6 infrared0) 214)
	(= (data Planet7 infrared0) 227)
	(= (data Star8 infrared0) 218)
	(= (data Planet9 infrared0) 228)
	(= (data Phenomenon4 image3) 261)
	(= (data Phenomenon5 image3) 195)
	(= (data Phenomenon6 image3) 152)
	(= (data Planet7 image3) 159)
	(= (data Star8 image3) 214)
	(= (data Planet9 image3) 60)
	(= (slew_time GroundStation3 Star0) 37.05)
	(= (slew_time Star0 GroundStation3) 37.05)
	(= (slew_time GroundStation3 Star1) 42.47)
	(= (slew_time Star1 GroundStation3) 42.47)
	(= (slew_time GroundStation3 GroundStation2) 52.41)
	(= (slew_time GroundStation2 GroundStation3) 52.41)
	(= (slew_time GroundStation2 Star0) 13.38)
	(= (slew_time Star0 GroundStation2) 13.38)
	(= (slew_time GroundStation2 Star1) 96.44)
	(= (slew_time Star1 GroundStation2) 96.44)
	(= (slew_time Star1 Star0) 35.06)
	(= (slew_time Star0 Star1) 35.06)
	(= (slew_time Phenomenon4 Star0) 49)
	(= (slew_time Star0 Phenomenon4) 49)
	(= (slew_time Phenomenon4 Star1) 8.149)
	(= (slew_time Star1 Phenomenon4) 8.149)
	(= (slew_time Phenomenon4 GroundStation2) 52.8)
	(= (slew_time GroundStation2 Phenomenon4) 52.8)
	(= (slew_time Phenomenon4 GroundStation3) 21.08)
	(= (slew_time GroundStation3 Phenomenon4) 21.08)
	(= (slew_time Phenomenon5 Star0) 56.58)
	(= (slew_time Star0 Phenomenon5) 56.58)
	(= (slew_time Phenomenon5 Star1) 39.6)
	(= (slew_time Star1 Phenomenon5) 39.6)
	(= (slew_time Phenomenon5 GroundStation2) 9.88)
	(= (slew_time GroundStation2 Phenomenon5) 9.88)
	(= (slew_time Phenomenon5 GroundStation3) 39.35)
	(= (slew_time GroundStation3 Phenomenon5) 39.35)
	(= (slew_time Phenomenon5 Phenomenon4) 6.105)
	(= (slew_time Phenomenon4 Phenomenon5) 6.105)
	(= (slew_time Phenomenon6 Star0) 8.724)
	(= (slew_time Star0 Phenomenon6) 8.724)
	(= (slew_time Phenomenon6 Star1) 51.26)
	(= (slew_time Star1 Phenomenon6) 51.26)
	(= (slew_time Phenomenon6 GroundStation2) 1.58)
	(= (slew_time GroundStation2 Phenomenon6) 1.58)
	(= (slew_time Phenomenon6 GroundStation3) 5.719)
	(= (slew_time GroundStation3 Phenomenon6) 5.719)
	(= (slew_time Phenomenon6 Phenomenon4) 30.85)
	(= (slew_time Phenomenon4 Phenomenon6) 30.85)
	(= (slew_time Phenomenon6 Phenomenon5) 56.26)
	(= (slew_time Phenomenon5 Phenomenon6) 56.26)
	(= (slew_time Planet7 Star0) 53.43)
	(= (slew_time Star0 Planet7) 53.43)
	(= (slew_time Planet7 Star1) 37.43)
	(= (slew_time Star1 Planet7) 37.43)
	(= (slew_time Planet7 GroundStation2) 19.35)
	(= (slew_time GroundStation2 Planet7) 19.35)
	(= (slew_time Planet7 GroundStation3) 30.64)
	(= (slew_time GroundStation3 Planet7) 30.64)
	(= (slew_time Planet7 Phenomenon4) 20.34)
	(= (slew_time Phenomenon4 Planet7) 20.34)
	(= (slew_time Planet7 Phenomenon5) 45.75)
	(= (slew_time Phenomenon5 Planet7) 45.75)
	(= (slew_time Planet7 Phenomenon6) 25.06)
	(= (slew_time Phenomenon6 Planet7) 25.06)
	(= (slew_time Star8 Star0) 25.34)
	(= (slew_time Star0 Star8) 25.34)
	(= (slew_time Star8 Star1) 39.65)
	(= (slew_time Star1 Star8) 39.65)
	(= (slew_time Star8 GroundStation2) 17.29)
	(= (slew_time GroundStation2 Star8) 17.29)
	(= (slew_time Star8 GroundStation3) 13.31)
	(= (slew_time GroundStation3 Star8) 13.31)
	(= (slew_time Star8 Phenomenon4) 59.14)
	(= (slew_time Phenomenon4 Star8) 59.14)
	(= (slew_time Star8 Phenomenon5) 22.26)
	(= (slew_time Phenomenon5 Star8) 22.26)
	(= (slew_time Star8 Phenomenon6) 31.12)
	(= (slew_time Phenomenon6 Star8) 31.12)
	(= (slew_time Star8 Planet7) 49.96)
	(= (slew_time Planet7 Star8) 49.96)
	(= (slew_time Planet9 Star0) 52.68)
	(= (slew_time Star0 Planet9) 52.68)
	(= (slew_time Planet9 Star1) 27.07)
	(= (slew_time Star1 Planet9) 27.07)
	(= (slew_time Planet9 GroundStation2) 17.36)
	(= (slew_time GroundStation2 Planet9) 17.36)
	(= (slew_time Planet9 GroundStation3) 17.77)
	(= (slew_time GroundStation3 Planet9) 17.77)
	(= (slew_time Planet9 Phenomenon4) 25.97)
	(= (slew_time Phenomenon4 Planet9) 25.97)
	(= (slew_time Planet9 Phenomenon5) 40.94)
	(= (slew_time Phenomenon5 Planet9) 40.94)
	(= (slew_time Planet9 Phenomenon6) 31.81)
	(= (slew_time Phenomenon6 Planet9) 31.81)
	(= (slew_time Planet9 Planet7) 16.1)
	(= (slew_time Planet7 Planet9) 16.1)
	(= (slew_time Planet9 Star8) 85.87)
	(= (slew_time Star8 Planet9) 85.87)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Phenomenon4)
	(pointing satellite3 Star1)
	(have_image Phenomenon4 image2)
	(have_image Phenomenon5 infrared1)
	(have_image Planet7 image2)
	(have_image Star8 image3)
	(have_image Planet9 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite3 star1 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 174 to 131.53, (fuel-used) from 0 to 42.47
   goals met: 1 of 7
2. (turn_to satellite1 phenomenon4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 189 to 136.2, (fuel-used) from 42.47 to 95.27
   goals met: 1 of 7
3. (turn_to satellite0 phenomenon4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 148 to 117.15, (fuel-used) from 95.27 to 126.12
   goals met: 2 of 7
4. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 7
5. (calibrate satellite2 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 2 of 7
6. (turn_to satellite2 planet9 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet9)
   changed: (fuel satellite2) from 157 to 139.64, (fuel-used) from 126.12 to 143.48
   goals met: 2 of 7
7. (turn_to satellite0 groundstation2 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 117.15 to 64.35, (fuel-used) from 143.48 to 196.28
   goals met: 1 of 7
8. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 136.2 to 128.051, (fuel-used) from 196.28 to 204.429
   goals met: 1 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
10. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 7
11. (turn_to satellite0 phenomenon5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 64.35 to 54.47, (fuel-used) from 204.429 to 214.309
   goals met: 1 of 7
12. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
13. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 7
14. (turn_to satellite1 planet7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 128.051 to 90.621, (fuel-used) from 214.309 to 251.739
   goals met: 1 of 7
15. (turn_to satellite0 star8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 54.47 to 32.21, (fuel-used) from 251.739 to 273.999
   goals met: 1 of 7
16. (take_image satellite0 star8 instrument0 image3)
   added: (have_image star8 image3)
   changed: (data_capacity satellite0) from 1000 to 786, (data-stored) from 0 to 214
   goals met: 2 of 7
17. (turn_to satellite0 phenomenon5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 32.21 to 9.95, (fuel-used) from 273.999 to 296.259
   goals met: 2 of 7
18. (take_image satellite2 planet9 instrument3 infrared1)
   added: (have_image planet9 infrared1)
   changed: (data_capacity satellite2) from 1000 to 935, (data-stored) from 214 to 279
   goals met: 3 of 7
19. (take_image satellite0 phenomenon5 instrument0 infrared1)
   added: (have_image phenomenon5 infrared1)
   changed: (data_capacity satellite0) from 786 to 778, (data-stored) from 279 to 287
   goals met: 4 of 7
20. (turn_to satellite0 phenomenon4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 9.95 to 3.845, (fuel-used) from 296.259 to 302.364
   goals met: 5 of 7
21. (take_image satellite1 planet7 instrument1 image2)
   added: (have_image planet7 image2)
   changed: (data_capacity satellite1) from 1000 to 900, (data-stored) from 287 to 387
   goals met: 6 of 7
22. (turn_to satellite1 phenomenon4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 90.621 to 70.281, (fuel-used) from 302.364 to 322.704
   goals met: 6 of 7
23. (take_image satellite1 phenomenon4 instrument1 image2)
   added: (have_image phenomenon4 image2)
   changed: (data_capacity satellite1) from 900 to 884, (data-stored) from 387 to 403
   goals met: 7 of 7
